import {FC} from 'react'

const ProjectGoals: FC = () => {
	return (
		<>
			<h2>Цели проекта</h2>
			<p>
				Оболочка rshell - учебный проект, нацеленный на улучшение понимания
				работы UNIX-подобных операционных систем, процессов и оболочек в целом,
				а также на изучение языка программирования Rust.
			</p>
			<p>
				Не смотря на то, что изначальная цель была достигнута, проект постепенно
				развивается. Я добавляю новый функционал и улучшаю существующий, занимаюсь
				рефакторингом и оптимизацией в свободное от учёбы время. Кроме того,
				появилась новая, более серьёзная мотивация - желание развивать российскую
				IT индустрию. Планируется участие в проектных конкурсах разного уровня,
				защита работы, участие в конференциях, выступления и т.д.
			</p>
		</>
	)
}

export default ProjectGoals
